output/tasks/excise-glom_mutation.py-glom.mutation.Delete._del_one/goldenSolution.diff
--- a/glom/mutation.py
+++ b/glom/mutation.py
@@ -289,7 +289,25 @@
         self.ignore_missing = ignore_missing
 
     def _del_one(self, dest, op, arg, scope):
-        return None
+        if op == '[':
+            try:
+                del dest[arg]
+            except IndexError as e:
+                if not self.ignore_missing:
+                    raise PathDeleteError(e, self.path, arg)
+        elif op == '.':
+            try:
+                delattr(dest, arg)
+            except AttributeError as e:
+                if not self.ignore_missing:
+                    raise PathDeleteError(e, self.path, arg)
+        elif op == 'P':
+            _delete = scope[TargetRegistry].get_handler('delete', dest)
+            try:
+                _delete(dest, arg)
+            except Exception as e:
+                if not self.ignore_missing:
+                    raise PathDeleteError(e, self.path, arg)
 
     def glomit(self, target, scope):
         op, arg, path = self.op, self.arg, self.path
